hiromendo/CAN-STM32_DEMO1/Eclipse-Project/src/main.c
  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
  /* USER CODE END WHILE */


  /* USER CODE BEGIN 3 */

  }
  /* USER CODE END 3 */

}

uint16_t maxim_spi_16bit_transfer(uint16_t u_mosi)
	/**
* \brief				SPI 16-bit transfer
*
* \param[in]		u_mosi: SPI transmit data
*
* \retval				SPI receive data
*/
{
	uint16_t u_miso;
	CS_ENABLE(GPIOB, NCS12_Pin);	//NCS = 0
	//SPI_I2S_SendData(SPI2, u_mosi);
	HAL_SPI_Transmit(&hspi2, &u_mosi, 2, TIMEOUT_VAL);
	/* Wait for SPI2 data reception */
	//while (SPI_I2S_GetFlagStatus(SPI2, SPI_I2S_FLAG_RXNE) == RESET);
	HAL_SPI_Receive(&hspi2, &u_miso, 2, TIMEOUT_VAL);
	//u_miso=SPI_I2S_ReceiveData(SPI2);
	CS_DISABLE(GPIOB, NCS12_Pin);	//NCS = 1
	return u_miso;
}



//Functions to help display/read text easier
void newLine() { //Basically prints a new line and moves cursor all the way to the left
	HAL_UART_Transmit(&huart2, (uint8_t*)"\n\r", strlen("\n\r"), HAL_MAX_DELAY);
}

void clrScr() { // Clears the screen. Moves cursor to 0,0
	HAL_UART_Transmit(&huart2, (uint8_t*)"\033[0;0H", strlen("\033[0;0H"), HAL_MAX_DELAY);
	HAL_UART_Transmit(&huart2, (uint8_t*)"\033[2J", strlen("\033[2J"), HAL_MAX_DELAY);
}

void printStr(char str[]) { //Prints the string that is passed into it
	HAL_UART_Transmit(&huart1, (uint8_t*)str, strlen(str), HAL_MAX_DELAY);
}

void printNum (int num) { //Prints number that is passed here (max of 20 in length atm)
	char buff[20];
	sprintf(buff, "%i", num);
	printStr(buff);
}
void readInput(char buff[], uint16_t size) { //Reads user input into buffer that is passed
	HAL_UART_Receive(&huart2, buff, size, HAL_MAX_DELAY);
}

void digitalread_task(void *pvArgs){
	uint32_t u_miso;
	uint8_t u_byte_h = 0;
	uint8_t u_byte_l = 0;
	uint8_t u_mosi = 0x00;
	for(;;){

		HAL_UART_Transmit(&huart1, (uint8_t*)"\n\r", strlen("\n\r"), HAL_MAX_DELAY);
		HAL_UART_Transmit(&huart1, (uint8_t *)"Hello", strlen("Hello"), HAL_MAX_DELAY);
		HAL_UART_Transmit(&huart1, (uint8_t*)"\n\r", strlen("\n\r"), HAL_MAX_DELAY);
		//u_miso = maxim_spi_16bit_transfer(0x00);
		CS_ENABLE(GPIOB, NCS12_Pin);	//NCS = 0
		//HAL_SPI_Transmit(&hspi2, &u_mosi, 2, TIMEOUT_VAL);
		HAL_SPI_Receive(&hspi2, &u_miso, 2, TIMEOUT_VAL);
		CS_DISABLE(GPIOB, NCS12_Pin);
		u_byte_h = u_miso>>24;
		u_byte_l = u_miso>>8;

		if(xQueueOverwrite(Global_Queue_Data_H, &u_byte_h)){
		   		HAL_UART_Transmit(&huart1, (uint8_t*)"DI_H in Queue\n\r", strlen("Temperature in Queue\n\r"), 0xFFFF);
		  	 }
		  	 else{
		    		HAL_UART_Transmit(&huart1, (uint8_t*)"Failed to add to Queue\n\r", strlen("Failed to add to Queue\n\r"), 0xFFFF);

		  	 }
		if(xQueueOverwrite(Global_Queue_Data_L, &u_byte_l)){
				   		HAL_UART_Transmit(&huart1, (uint8_t*)"DI_L in Queue\n\r", strlen("Temperature in Queue\n\r"), 0xFFFF);
				  	 }
			else{
				    		HAL_UART_Transmit(&huart1, (uint8_t*)"Failed to add to Queue\n\r", strlen("Failed to add to Queue\n\r"), 0xFFFF);

				  	 }
		sprintf(Byte, "\n\rByteH = %x\n\r", u_byte_h);
        HAL_UART_Transmit(&huart1, (uint8_t *)Byte, 30, TIMEOUT_VAL);
        sprintf(Byte, "\n\rByteL = %x\n\r", u_byte_l);
        HAL_UART_Transmit(&huart1, (uint8_t *)Byte, 30, TIMEOUT_VAL);


		//u_byte = u_miso;
		//printf("0X%02X  <", u_byte);
		//printf(BYTETOBINARYPATTERN, BYTETOBINARY(u_byte));

		HAL_GPIO_TogglePin(LED1_GPIO_Port, LED1_Pin);
		vTaskDelay(pdMS_TO_TICKS(10));

	}
}

void SerialRead_task(void *pvArgs) {

	char input_buff[1] = {0};

	for(;;) {
		///if(xSemaphoreTake(choice_mutex, pdMS_TO_TICKS(500))) { //Only run when choice_mutex is available
			clrScr();

			//display_main_menu();

			readInput(input_buff, 1); //Get users choice here
			printStr(input_buff); //Display users own input

			if(input_buff[0] == '0') { //Continuous read mode
				printStr("Got 0"); //Error checking (possible to get specific error)

			} else if(input_buff[0] == '1') { //Single read mode
				printStr("Got 1"); //Error checking (possible to get specific error)
			}

			else { //If invalid number is entered
				//xSemaphoreGive(choice_mutex); //Give mutex, so task can grab it again (avoids deadlock)

			}
		//}
	}
}


void receive_task(void *pvArgs) {

	uint8_t data_holder;
	uint8_t data_to_send;
	uint8_t ok_to_send;
	HAL_StatusTypeDef TransmitReturn;
	///uint32_t u_miso; /// this is for the DI code

	uint8_t u_byte_h = 0;
	uint8_t u_byte_l = 0;
	uint8_t u_byte_h_config = 0;
	uint8_t u_byte_l_config = 0;
	uint16_t u_mosi = 0x0300; ///// this is the output code
	uint32_t u_value = 0x00000000;
	uint32_t u_fault_condition = 0x00000000;


	for(;;) {

		HAL_UART_Transmit(&huart1, (uint8_t*)"\n\r", strlen("\n\r"), HAL_MAX_DELAY);
  		if(HAL_CAN_Receive(&hcan, CAN_FIFO0, 1000) != HAL_OK) { //Try to receive

  			HAL_UART_Transmit(&huart1, (uint8_t *)"Receiving error!!", strlen("Receiving error!!"), HAL_MAX_DELAY);
  			HAL_UART_Transmit(&huart1, (uint8_t*)"\n\r", strlen("\n\r"), HAL_MAX_DELAY);

  		} else { //Succes!

  			data_holder = hcan.pRxMsg->Data[0];
  			u_byte_h = hcan.pRxMsg->Data[1];
  			u_byte_l = hcan.pRxMsg->Data[2];
  			u_byte_h_config = hcan.pRxMsg->Data[3];
  			u_byte_l_config = hcan.pRxMsg->Data[4];
  			//char buff[20];
  			if(data_holder == 2){

  				///This is the DO output command
  				//ok_to_send = 255;
				CS_ENABLE(GPIOB, NCS12_Pin);	//NCS = 0
				u_value=(u_byte_l<<24) + (u_byte_l_config<<16) + (u_byte_h<<8) + u_byte_h_config;
				HAL_SPI_Transmit(&hspi2, &u_value, 2, TIMEOUT_VAL);
				//HAL_SPI_Receive(&hspi2, &u_fault_condition, 2, TIMEOUT_VAL);
				CS_DISABLE(GPIOB, NCS12_Pin);
				//sprintf(Byte, "\n\rByteH = %x\n\r", u_fault_condition);
			    //HAL_UART_Transmit(&huart1, (uint8_t *)Byte, 30, TIMEOUT_VAL);
			    //vTaskDelay(pdMS_TO_TICKS(1000));

				hcan.pTxMsg->Data[0] = 0xCC; /// Acknowledgment
				hcan.pTxMsg->Data[1] = 0x00;
				hcan.pTxMsg->Data[2] = 0x00;
				//hcan.pTxMsg->Data[1] = Data_receive_h;
				//hcan.pTxMsg->Data[2] = Data_receive_l;
				hcan.pTxMsg->Data[3] = 0x00;
				hcan.pTxMsg->Data[4] = 0x00;
				hcan.pTxMsg->Data[5] = 0x00;
				hcan.pTxMsg->Data[6] = 0x00;
				hcan.pTxMsg->Data[7] = 0x00;

				ok_to_send = 255;

				while (ok_to_send == 255) {

				TransmitReturn = HAL_CAN_Transmit(&hcan, 5); //Try to transmit and get result

